"""
https://github.com/DimbreathBot/AnimeGameData
https://github.com/kj415j45/octavia
"""

STAGE_TYPES_JA = {
    '动作冒险': 'アクションアドベンチャー',
    '生存竞技': 'サバイバル',
    '第一人称射击': 'FPS',
    '模拟经营': '経営シミュレーション',
    '多人在线竞技': 'オンラインマルチ対戦',
    '肉鸽': 'ローグライク',
    '第三人称射击': 'TPS',
    '非对称竞技': '非対称型PVP',
    '乱斗': 'バトルロイヤル',
    '共斗': '共闘',
    '派对': 'パーティー',
    '合作': '協力プレイ',
    '跑酷': 'パルクール',
    '探索解密': 'ギミック',
    '生存建造': 'サバイバルクラフト',
    '角色扮演': 'ロールプレイング',
    '情景观赏': 'ワールド鑑賞',
    '战术策略': 'タクティカルストラテジー',
    '塔防': 'タワーディフェンス',
    '体育': 'スポーツ',
    '竞速': '競走',
    '桌游': 'ボードゲーム',
    '放置': '放置系',
    '悬疑惊悚': 'ミステリーホラー',
    '音乐节奏': '音ゲー',
    '休闲益智': 'カジュアルパズル',
}

STAGE_TAGS_JA = {
    '第一人称': '一人称視点',
    '第三人称': '三人称視点',
    '俯视角': '俯瞰視点',
    '固定镜头': '固定カメラ',
    '越肩视角': '肩越し視点',
    '休闲': 'カジュアル',
    '中等': 'ノーマル',
    '困难': 'ハード',
    '硬核': 'ハードコア',
    '动态难度': '難易度が変動',
}

STAGE_CATEGORIES_JA = {
    '长线游玩': '長時間プレイ',
    '轻量趣味': 'お手軽ステージ',
}
